
# Задача 2: Определение расположения точки (x, y)

try:
    x = int(input("Введите координату x: "))
    y = int(input("Введите координату y: "))

    if x == 0 and y == 0:
        print(0)   # Точка в начале координат
    elif x == 0:
        print(2)   # Точка на оси OY
    elif y == 0:
        print(1)   # Точка на оси OX
    else:
        print(3)   # Точка не на осях
except ValueError:
    print("Ошибка: вводите только целые числа.")
